---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.IsFocalNode
source: html/1948949a-5da0-2825-fc2c-856ac4711068.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalNode.IsFocalNode Property

Is this node a focal point of multiple branches?

## Syntax (C#)
```csharp
public bool IsFocalNode { get; }
```